{
    "gameName": "The Kitten's Oubliette",
    "lookAction": "Look around again.",
    "examineAction": "Examine the",
    "pickupAction": "Pick up the",
    "emptyPockets": "Your pockets are empty.",
    "startLocation": "dungeonCell",
    "firstMessage": "You awaken after what feels like a very long slumber...",
    "dungeonCell": {
        "name": "Dungeon Cell",
        "description": "You find yourself in a cold and dark dungeon cell. Moonlight comes in through the barred window, and dampness accumulates on the cold walls. There's strange etchings carved into the wall opposite the cell's bed. You have no recollection of how you got here, but it probably kind of sucked.",
        "img": "assets/dungeonCell.png",
        "imgAlt": "A dark dungeon cell with a bed on the left, and a barred window. You can see the Moon and some trees through the window.",
        "items": {
            "key": {
                "description": "On the ground, there is a golden key. It glistens in the moonlight.",
                "itemDescription": "It is a shiny gold key. It is very well crafted, and very heavy. It feels like it would probably pair well with a massive cell door.",
                "result": "You pick up the key, and feel empowered about your future.",
                "canPickUp": true
            },
            "etchings": {
                "itemDescription": "Scratched into the walls are the words \"Help, I'm trapped in a JavaScript Factory\". Who could have written this?"
            }
        },
        "actions": [
            {
                "action": "Look out the window.",
                "result": "You peak out through the window...",
                "forceDescription": "The Moon glows bright in the night sky. It is a full Moon, illuminating a foreboding forest around this mysterious prison."
            },
            {
                "ifNot": ["lighter"],
                "action": "Examine the bed.",
                "result": "You examine the bed...",
                "forceDescription": [
                    "The bed appears to have been heavily used. How long have you been here?",
                    "You found a lighter hidden under the pillow!"
                ],
                "addInventory": "lighter",
                "itemDescription": "A clunky brass lighter with a flip top. A pair of curly braces are etched into it's exterior."
            },
            {
                "if": ["lighter"],
                "action": "Examine the bed.",
                "result": "You examine the bed...",
                "forceDescription": [
                    "The bed appears to have been heavily used. How long have you been here?",
                    "There doesn't appear to be anything else hidden here."
                ]
            },
            {
                "ifNot": ["cellOpen"],
                "action": "Open cell door.",
                "result": "You try to open the door, but it is locked shut. Its wrought iron bars will not yield, however hard you pull!"
            },
            {
                "if": ["key"],
                "ifNot": ["cellOpen"],
                "needsItem": true,
                "action": "Unlock cell door using the key.",
                "result": "You unlock the cell door. It makes a very satisfying clinking sound. The cell door swings open!",
                "addFlag": "cellOpen",
                "checkInventory": ["key"]
            },
            {
                "if": ["cellOpen"],
                "action": "Walk out through cell door.",
                "result": "You walk out of the cell!",
                "setLocation": "dungeonHall"
            }
        ]
    },
    "dungeonHall": {
        "name": "Dungeon Hallway",
        "img": "assets/dungeonHallDark.png",
        "imgAlt": "A dark hall extends into the distance. A barred door is to the left, and next to that door, is an unlit torch",
        "conditionalDescriptions" : [
            {
                "if":["torch"],
                "img": "assets/dungeonHallLight.png",
                "imgAlt": "A hall extends into the distance. A barred door is to the left. The torch has been removed from its holder next to the cell door, because it is now in your inventory.",
                "description": "Your torchlight flickers down the otherwise barely lit hallway. There are a total of four dungeon cells here, in addition to the one you awakened in. The floor and walls are smoothly cut granite. In the light, you can see that the hallway extends to the north, before taking a hard right turn."
            },
            {
                "ifNot":["torch"],
                "description": "The hallway beyond the cell door is dark and foreboding. From the moonlight coming in through the windows, you can see that there are three cells in addition to the one you awakened in. However, it is far too dark to see anything else."
            }
        ],
        "actions": [
            {
                "ifNot":["torch"],
                "description": "There is an unlit torch affixed to the wall.",
                "action": "Examine the torch.",
                "result": "You take a look at the torch...",
                "forceDescription": "It's a short iron staff with one end wrapped in cloth. It looks like it's soaked with a flammable liquid, if only you could light it..."
            },
            {
                "if":["lighter"],
                "ifNot":["torch"],
                "action": "Ignite the torch with the lighter.",
                "needsItem": true,
                "result": "You set the torch aflame!",
                "examineRoom": true,
                "addInventory": "torch",
                "checkInventory": ["torch","lighter"],
                "itemDescription": "It's a short iron staff with one end aflame. Its light helps you see your surroundings."
            },
            {
                "action": "Return to the dungeon cell.",
                "result": "You walk back into your former dungeon cell. Being here sends shivers down your spine.",
                "setLocation": "dungeonCell"
            },
            {
                "if": ["torch"],
                "action": "Go north along the hallway.",
                "result": "You walk north along the hallway, and turn the corner...",
                "setLocation": "atrium"
            }
        ]
    },
    "atrium": {
        "name": "The Atrium",
        "img": "assets/atrium.png",
        "imgAlt": "A large interior area is depicted. There's multiple archways in multiple directions. The Moon can be seen through the skylight. On the wall is art of two devilish entities, drawn in red, with the text 'Floats rule' and 'Hail clearfix' written in all uppercase letters.",
        "description": "You find yourself in a large atrium. A glass covered skylight lets the light of the moon shimmer down into the area. Your torch light flickers along many large murals depicting creatures that almost look demonic. Four stone pillars hold the ceiling aloft, several storeys up. An archway leads into the hallways towards the dungeon cells, and another archway leads north towards another room. Small chunks of what appears to be coal litter the ground.",
        "conditionalDescriptions": [
            {
                "if": ["catFriend"],
                "description": "The cat demon is taking a nap in the corner. Best not to disturb them."
            }
        ],
        "items": {
            "coal": {
                "itemDescription": "This 'coal' is extremely similar to the coal you know and love, but upon closer inspection doesn't quite match it. The shape is wrong, and it kind of smells like... cat?"
            },
            "murals": {
                "itemDescription": "These murals are enormous depictions of creatures with enormous horns, and red eyes. They all seem to be smiling. Text below the murals reads \"Praise be to floats! Hail to clearfix!\"."
            }
        },
        "actions" : [
            {
                "ifNot": ["triedToLeave","catFriend"],
                "description": "One large archway leads eastwards. You can smell the fresh forest air just beyond it. Could it be a way out?",
                "action": "Walk east and exit this vile place.",
                "result": "You start to walk east, when suddenly a small gray haired creature appears...",
                "forceDescription": [
                    "It is a cat! Small, gray haired. Your first instinct is to walk towards them, when they glance towards you and you see their eyes glow red like embers. Smoke billows from them at their every breath.",
                    "At the sight of you, their tail wiggles. They let out a rumbling sound that shakes your core, like a monstrous cacophany echoing from the deepest, darkest abyss:",
                    "\"MEOW!!! =^.^=\""
                ],
                "addFlag": "triedToLeave"
            },
            {
                "if": ["triedToLeave"],
                "ifNot": ["catFriend"],
                "description": "The cat demon sits directly between you and the dungeon exit. They block your way. You must find a way to appease the cat.",
                "action": "Talk to the cat demon.",
                "result": "Uneasily, you approach the cat demon...",
                "setLocation": "catDemon"
            },
            {
                "action": "Explore towards the north.",
                "result": "You walk north through the archway, into a strange room...",
                "setLocation": "puzzleRoom"
            },
            {
                "if": ["catFriend"],
                "description": "The large archway to the east is no longer blocked. This is your chance to escape!",
                "action": "Walk east and exit this vile dungeon.",
                "result": "You walk east through the large archway...",
                "setLocation": "outside"
            }
        ]
    },
    "puzzleRoom": {
        "name": "Clockwork Computer Room",
        "img": "assets/clockworkComputer.png",
        "imgAlt": "A machine is depicted. It is broad, with two large feet, and a recessed area in the middle containing a big red button. A half pipe leads out of a hole below the recessed area, leading into a big blueish gray bowl. Bronze cogs adorn the entire machine, and three large smokestacks protrude from its top. There are three levers next to it, a red one, a yellow one, and a blue one.",
        "conditionalDescriptions": [
            {
                "if":["powerButton"],
                "ifNot":["treatDeposited"],
                "description": "This strange room is dominated by an enormous contraption. It has hundreds of cogs and gears, spinning wildly. A steam motor chugs along, periodically letting out a loud tooting sound, and several levers stick out for a user to operate. There is a cacophony of sound, almost musical, while the machine works towards whatever strange purpose it might have."
            },
            {
                "ifNot": ["powerButton"],
                "description": "This strange room is dominated by an enormous contraption. It has hundreds of cogs, and an enormous water tank. It looks as though it hasn't been turned on in decades."
            },
            {
                "ifNot":["treatDeposited"],
                "description": "At the base of the machine is an empty dish, covered with eons old claw marks."
            },
            {
                "if": ["treatDeposited"],
                "description": "This strange room is dominated by an enormous contraption. It has hundreds of cogs, and an enormous water tank. Steam is venting from the machine as it cools down from its recent activity."
            },
            {
                "if": ["treatRemoved"],
                "description": "At the base of the machine is an empty dish. You suspect it has received its quota of treats for the day."
            }
        ],
        "actions": [
            {
                "if": ["treatDeposited"],
                "ifNot": ["kitty treat","treatRemoved"],
                "action": "Take the kitty treat.",
                "result": "You pick up the kitty treat! You can feel it pulse in your hands with unholy magic.",
                "description": "You notice a large and juicy looking kitty treat in the machine's dish!",
                "addInventory": "kitty treat",
                "addFlag": "treatRemoved",
                "itemDescription": "It is a big and juicy kitty treat. It is ball shaped and brown in colour. Disconcertingly, the smell reminds you of the souls of the damned."
            },
            {
                "ifNot": ["powerButton"],
                "description": "There is a big red button in the middle of the machine.",
                "action": "Push the big red button.",
                "result": "You push the big red button. With a loud creaking noise, the machine begins to operate! Centuries old clockwork bursts into motion, and you are almost deafened by the sound of venting steam!",
                "addFlag": "powerButton",
                "examineRoom": true
            },
            {
                "ifNot": ["treatDeposited","redLever"],
                "if": ["powerButton"],
                "description": "The end of a red lever glows, inviting you to pull it.",
                "action": "Pull the red lever.",
                "result": "You pull the red lever. Its light goes out. A yellow lever and a blue lever light up!",
                "addFlag": "redLever"
            },
            {
                "ifNot": ["treatDeposited","yellowLever"],
                "if": ["redLever"],
                "description": "One of the yellow levers is glowing, ready to be pulled.",
                "action": "Pull the yellow lever.",
                "result": "You pull the yellow lever. Its light goes out. The blue lever remains on, and the red lever reactivates!",
                "addFlag": "yellowLever"
            },
            {
                "ifNot": ["treatDeposited","yellowLever"],
                "if": ["redLever"],
                "description": "A blue lever glows, as if begging to be pulled!",
                "action": "Pull the blue lever.",
                "result": "You pull the blue lever. Both it and the yellow lever flicker off! The red lever lights up once more.",
                "removeFlag": "redLever"
            },
            {
                "ifNot": ["treatDeposited","blueLever"],
                "if": ["yellowLever"],
                "description": "The blue lever is glowing!",
                "action": "Pull the blue lever.",
                "result": "You pull the blue lever. Its light goes out. The big red button in the center of the machine starts to flash!",
                "addFlag": "blueLever"
            },
            {
                "ifNot": ["treatDeposited","blueLever"],
                "if": ["yellowLever"],
                "description": "The red lever glows brightly!",
                "action": "Pull the red lever.",
                "result": "You pull the red lever. The blue light flickers off, but the red lever remains glowing.",
                "removeFlag": ["yellowLever","redLever"]
            },
            {
                "ifNot": ["treatDeposited"],
                "if": ["blueLever"],
                "description": "The big red button is flashing rapidly!",
                "action": "Push the big red button again.",
                "result": "You push the big red button! With a thunk, an object is deposited into the bowl beneath the machine, and the whole contraption grinds to a halt!",
                "addFlag": "treatDeposited",
                "examineRoom": true
            },
            {
                "ifNot": ["treatDeposited"],
                "if": ["blueLever"],
                "description": "The red lever glows brightly!",
                "action": "Pull the red lever.",
                "result": "You pull the red lever. The big red button stops flashing.",
                "removeFlag": ["yellowLever","redLever","blueLever"]
            },
            {
                "action": "Return to the atrium.",
                "result": "You walk through the archway and return to the atrium...",
                "setLocation": "atrium"
            }
        ]
    },
    "catDemon": {
        "name": "The Cat Demon",
        "conditionalDescriptions": [
            {
                "ifNot": ["catPetted","catFed"],
                "description": "Sitting before you is the most fiendish cat you have ever seen. With long gray hair, and eyes that glow like the pits of hell itself."
            },
            {
                "ifNot": ["catPetted","catFed"],
                "description": "The cat gazes at you. Their eyes bore into your very heart and soul..."
            },
            {
                "if": ["catPetted"],
                "ifNot": ["catFed"],
                "description": "The cat demon purrs loudly. The deep rumbling causes the entire dungeon to shake!"
            },
            {
                "if": ["catFed"],
                "ifNot": ["catPetted"],
                "description": "The cat demon is rubbing against your legs. They crave affection!"
            },
            {
                "if": ["kitty treat"],
                "description": "The cat demon senses the kitty treat on your person. They gaze at you and lick their lips..."
            },
            {
                "if": ["catFed","catPetted"],
                "ifNot": ["catFriend"],
                "description": "The cat demon seems very happy! But you sense there's one last thing they need..."
            },
            {
                "if": ["catFriend"],
                "img": "assets/sleepyDemonCat.jpg",
                "imgAlt": "A medium haired grey cat with crimson eyes, sleeping on their back in a corner. They look very comfortable.",
                "description": "The cat demon is pleased, and is now taking a nap."
            }
        ],
        "img": "assets/demonCat.jpg",
        "imgAlt": "A medium haired grey cat with crimson eyes, sitting in the middle of an open doorway. They are staring directly at you.",
        "actions": [
            {
                "action": "Step away from the cat.",
                "result": "You slowly and carefully step away from the cat demon.",
                "setLocation": "atrium"
            },
            {
                "action": "Pet the cat.",
                "result": "You reach out your hand to pet the cat demon...",
                "forceDescription": [
                    "They look at your hand, at first with suspicion, but then they push their small fluffy head into your hand and let you pet them.",
                    "The heat coming from them is intense, and you're vaguely worried that you'll get burns, but they're just so darn cute!"
                ],
                "examineRoom": true,
                "addFlag": "catPetted"
            },
            {
                "if": ["kitty treat"],
                "action": "Give the kitty treat to the cat demon.",
                "result": "With the kitty treat pulsing in your hand, you hold it out...",
                "forceDescription": [
                    "The cat demon lets out a guttural meow that makes your bones shake as they trot towards you and enthusiastically eat the kitty treat!"
                ],
                "needsItem": true,
                "examineRoom": true,
                "addFlag": "catFed",
                "removeInventory": "kitty treat"
            },
            {
                "if": ["catFed", "catPetted"],
                "action": "Tell them they are a very good kitty.",
                "result": "You tell the cat demon how good of a cat they are. And they believe you!",
                "examineRoom": true,
                "addFlag": "catFriend"
            }
        ]
    },
    "outside": {
        "name": "Freedom!",
        "description": "You are outside! You have escaped from the dungeon and are free!",
        "img": "assets/outside.jpg",
        "imgAlt": "A panoramic view of the great outdoors at night. The full Moon shines bright in the sky, over a boreal forest. The large gray castle you just escaped from dominates the view, but looks much smaller from here.",
        "actions": [
            {
                "action": "Restart the game.",
                "description": "Thank you for playing!",
                "result": "You decide to restart the game, and awaken to discover that your previous playthrough was all a dream...",
                "setLocation": "dungeonCell",
                "resetAll": true
            }
        ]
    }
}